In [63]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt

In [64]:
df = pd.read_csv("adult.test")
df.head()

,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0.1,40,United-States,<=50K.
0,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K.
1,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K.
2,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K.
3,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K.
4,34,Private,198693,10th,6,Never-married,Other-service,Not-in-family,White,Male,0,0,30,United-States,<=50K.

In [65]:
df = pd.read_csv("adult.test", header=None)
df

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K.
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K.
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K.
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K.
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K.
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16276,39,Private,215419,Bachelors,13,Divorced,Prof-specialty,Not-in-family,White,Female,0,0,36,United-States,<=50K.
16277,64,?,321403,HS-grad,9,Widowed,?,Other-relative,Black,Male,0,0,40,United-States,<=50K.
16278,38,Private,374983,Bachelors,13,Married-civ-spouse,Prof-specialty,Husband,White,Male,0,0,50,United-States,<=50K.
16279,44,Private,83891,Bachelors,13,Divorced,Adm-clerical,Own-child,Asian-Pac-Islander,Male,5455,0,40,United-States,<=50K.
16280,35,Self-emp-inc,182148,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,60,United-States,>50K.

In [66]:
df.columns = ['age', 'workclass','fnlwgt','education','education-num ','marital-status ','occupation','relationship','race','sex',' capital-gain','capital-loss','hours-per-week','native-country','salary']

In [67]:
df.shape

(16281, 15)

In [68]:
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K.
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K.
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K.
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K.
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K.

In [76]:
df.dtypes

age                 int64
workclass          object
fnlwgt              int64
education          object
education-num       int64
marital-status     object
occupation         object
relationship       object
race               object
sex                object
 capital-gain       int64
capital-loss        int64
hours-per-week      int64
native-country     object
salary             object
dtype: object

In [78]:
df.size

244215

In [70]:
df.describe()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
count,16281.000000,1.628100e+04,16281.000000,16281.000000,16281.000000,16281.000000
mean,38.767459,1.894357e+05,10.072907,1081.905104,87.899269,40.392236
std,13.849187,1.057149e+05,2.567545,7583.935968,403.105286,12.479332
min,17.000000,1.349200e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.167360e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.778310e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.383840e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.490400e+06,16.000000,99999.000000,3770.000000,99.000000

How many people of each race are represented in this dataset? This should be a Pandas series with race names as the index labels.

In [71]:
df['race'].value_counts()

 White                 13946
 Black                  1561
 Asian-Pac-Islander      480
 Amer-Indian-Eskimo      159
 Other                   135
Name: race, dtype: int64

What is the average age of men?

In [72]:
df.loc[df['sex'] == 'Male', 'age'].mean()

nan

What is the percentage of people who have a Bachelor's degree?

In [74]:
round(100 * df.loc[df["education"] == "Bachelors"].size / df.size)

0

In [82]:
df.loc[df["education"] == "Bachelors"].size

0

What percentage of people with advanced education (Bachelors, Masters, or Doctorate) make more than 50K?

In [44]:
hd=df.loc[df["education"].isin(["Bachelors", "Masters", "Doctorate"])]
round(100* hd.loc[hd["salary"] == ">50K"].size/ hd.size,1,)

/tmp/ipykernel_16944/961412800.py:2: RuntimeWarning: invalid value encountered in long_scalars
  round(100* hd.loc[hd["salary"] == ">50K"].size/ hd.size,1,)

nan

What percentage of people without advanced education make more than 50K?

In [45]:
ld=df.loc[~df["education"].isin(["Bachelors", "Masters", "Doctorate"])]
round(100* ld.loc[ld["salary"] == ">50K"].size/ ld.size,1,)

0.0

What is the minimum number of hours a person works per week?

In [49]:
min_work_hours=df["hours-per-week"].min()
min_work_hours

1

What percentage of the people who work the minimum number of hours per week have a salary of more than 50K?

In [57]:
num_min_workers =df.loc[df["hours-per-week"] == min_work_hours]

round(100* num_min_workers.loc[num_min_workers["salary"] == ">50K"].size/ num_min_workers.size,1,)
num_min_workers

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
870,73,Self-emp-not-inc,252431,Some-college,10,Married-civ-spouse,Prof-specialty,Wife,White,Female,0,0,1,United-States,<=50K.
2655,54,?,186565,Masters,14,Divorced,?,Not-in-family,White,Male,0,0,1,United-States,<=50K.
7078,22,Private,173004,HS-grad,9,Never-married,Machine-op-inspct,Other-relative,Black,Male,0,0,1,United-States,<=50K.
9076,39,Private,465334,11th,7,Divorced,Farming-fishing,Unmarried,White,Male,0,0,1,United-States,<=50K.
10447,29,Private,165737,Bachelors,13,Never-married,Prof-specialty,Not-in-family,Asian-Pac-Islander,Male,0,0,1,Japan,<=50K.
11166,62,Private,312818,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,1902,1,United-States,>50K.
11802,32,?,78374,Bachelors,13,Never-married,?,Not-in-family,Asian-Pac-Islander,Female,0,0,1,United-States,<=50K.

What country has the highest percentage of people that earn >50K and what is that percentage?

In [61]:
 highest_country=(df[["salary", "native-country"]]
                  .groupby("native-country").apply(lambda g: g.loc[g["salary"] == ">50K"].size / g.size * 100))
highest_earning_country = highest_country.idxmax()
highest_earning_country_percentage = round(highest_country.max(), 1)
highest_earning_country_percentage

0.0

Identify the most popular occupation for those who earn >50K in India

In [62]:
df.loc[(df["native-country"] == "India") & (df["salary"] == ">50K")]["occupation"].value_counts().idxmax()

ValueError: attempt to get argmax of an empty sequence